Project/Toir/src/Reports/торо_ПринятиеКУчетуВыбытиеОборудования/торо_ПринятиеКУчетуВыбытиеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПринятиеКУчетуВыбытиеОборудования</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_СтатусыОбъектовРемонтаВУчете/торо_СтатусыОбъектовРемонтаВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыОбъектовРемонтаВУчете</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОР</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыОРВУчете</name>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>ОсновнаяИерархия</name>
      <description>Основная иерархия</description>
    </items>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныеЭлементыВДереве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_ПринятиеКУчетуВыбытиеОборудования/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ДатаПринятия КАК ДатаПринятия,
		|	ВТ_Данные.ДокументПринятия КАК ДокументПринятия,
		|	ВТ_Данные.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
		|	ВТ_Данные.ДокументСнятияСУчета КАК ДокументСнятияСУчета,
		|	ВТ_Данные.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ДатаПринятия КАК ДатаПринятия,
		|	ВТ_Данные.ДокументПринятия КАК ДокументПринятия,
		|	ВТ_Данные.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
		|	ВТ_Данные.ДокументСнятияСУчета КАК ДокументСнятияСУчета,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_СтатусыОбъектовРемонтаВУчете.Период КАК Период,
	|	торо_СтатусыОбъектовРемонтаВУчете.Регистратор КАК Регистратор,
	|	торо_СтатусыОбъектовРемонтаВУчете.СтатусОР КАК СтатусОР
	|ПОМЕСТИТЬ ТаблицаСоответствующаяПараметрам
	|ИЗ
	|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|ГДЕ
	|	торо_СтатусыОбъектовРемонтаВУчете.СтатусОР В(&СтатусыКВыводу)
	|{ГДЕ
	|	(торо_СтатусыОбъектовРемонтаВУчете.Период >= &ДатаНачала),
	|	(торо_СтатусыОбъектовРемонтаВУчете.Период <= &ДатаОкончания)}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаСоответствующаяПараметрам.ОбъектРемонта КАК ОбъектРемонта,
	|	ВЫБОР
	|		КОГДА ТаблицаСоответствующаяПараметрам.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету)
	|			ТОГДА ТаблицаСоответствующаяПараметрам.Период
	|		ИНАЧЕ торо_СтатусыОбъектовРемонтаВУчете.Период
	|	КОНЕЦ КАК ДатаПринятия,
	|	ВЫБОР
	|		КОГДА ТаблицаСоответствующаяПараметрам.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету)
	|			ТОГДА ТаблицаСоответствующаяПараметрам.Регистратор
	|		ИНАЧЕ торо_СтатусыОбъектовРемонтаВУчете.Регистратор
	|	КОНЕЦ КАК ДокументПринятия,
	|	ВЫБОР
	|		КОГДА ТаблицаСоответствующаяПараметрам.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.СнятоСУчета)
	|			ТОГДА ТаблицаСоответствующаяПараметрам.Период
	|		ИНАЧЕ торо_СтатусыОбъектовРемонтаВУчете.Период
	|	КОНЕЦ КАК ДатаСнятияСУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаСоответствующаяПараметрам.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.СнятоСУчета)
	|			ТОГДА ТаблицаСоответствующаяПараметрам.Регистратор
	|		ИНАЧЕ торо_СтатусыОбъектовРемонтаВУчете.Регистратор
	|	КОНЕЦ КАК ДокументСнятияСУчета
	|ПОМЕСТИТЬ ТаблицаСовокупная
	|ИЗ
	|	ТаблицаСоответствующаяПараметрам КАК ТаблицаСоответствующаяПараметрам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	|		ПО (торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = ТаблицаСоответствующаяПараметрам.ОбъектРемонта)
	|			И (торо_СтатусыОбъектовРемонтаВУчете.СтатусОР <> ТаблицаСоответствующаяПараметрам.СтатусОР)
	|			И (торо_СтатусыОбъектовРемонтаВУчете.СтатусОР В (ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету), ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.СнятоСУчета)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСовокупная.ОбъектРемонта КАК ОбъектРемонта,
	|	МИНИМУМ(ТаблицаСовокупная.ДатаПринятия) КАК ДатаПринятия,
	|	МАКСИМУМ(ТаблицаСовокупная.ДатаСнятияСУчета) КАК ДатаСнятияСУчета
	|ПОМЕСТИТЬ ТаблицаМинИМакс
	|ИЗ
	|	ТаблицаСовокупная КАК ТаблицаСовокупная
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСовокупная.ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаМинИМакс.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаСовокупнаяДляПринятых.ДатаПринятия КАК ДатаПринятия,
	|	ТаблицаСовокупнаяДляПринятых.ДокументПринятия КАК ДокументПринятия,
	|	ТаблицаСовокупнаяДляСнятых.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
	|	ТаблицаСовокупнаяДляСнятых.ДокументСнятияСУчета КАК ДокументСнятияСУчета
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ТаблицаМинИМакс КАК ТаблицаМинИМакс
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСовокупная КАК ТаблицаСовокупнаяДляПринятых
	|		ПО ТаблицаМинИМакс.ОбъектРемонта = ТаблицаСовокупнаяДляПринятых.ОбъектРемонта
	|			И ТаблицаМинИМакс.ДатаПринятия = ТаблицаСовокупнаяДляПринятых.ДатаПринятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСовокупная КАК ТаблицаСовокупнаяДляСнятых
	|		ПО ТаблицаМинИМакс.ОбъектРемонта = ТаблицаСовокупнаяДляСнятых.ОбъектРемонта
	|			И ТаблицаМинИМакс.ДатаСнятияСУчета = ТаблицаСовокупнаяДляСнятых.ДатаСнятияСУчета"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции

#КонецОбласти
